ELPasEDT/src/AccumulationRegisters/РеагентыВПодразделениях/РеагентыВПодразделениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РеагентыВПодразделениях</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМоногидратаВБазовойЕдинице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходРеагента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ELPasEDT/src/InformationRegisters/НастройкиУчетаРеагентовПоОрганизациям/НастройкиУчетаРеагентовПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаРеагентовПоОрганизациям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/AccumulationRegisters/РеагентыВПодразделениях/ManagerModule.bsl
Процедура ВыполнитьКонтрольОстатков(Параметры, Отказ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиУчетаРеагентовПоОрганизациямСрезПоследних.КонтрольОстатков КАК КонтрольОстатков
	|ИЗ
	|	РегистрСведений.НастройкиУчетаРеагентовПоОрганизациям.СрезПоследних(&Период, Организация = ВЫРАЗИТЬ(&Подразделение КАК Справочник.Подразделения).Организация) КАК НастройкиУчетаРеагентовПоОрганизациямСрезПоследних");
	Запрос.УстановитьПараметр("Подразделение", Параметры.Подразделение);
	Запрос.УстановитьПараметр("Период",        Параметры.Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Или Не Выборка.КонтрольОстатков Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеагентыВПодразделенияхОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.РеагентыВПодразделениях.Остатки(
	|			&Период,
	|			ВидРеагента = &ВидРеагента
	|				И Партия = &Партия
	|				И Подразделение = &Подразделение
	|				И Реагент = &Реагент) КАК РеагентыВПодразделенияхОстатки";
	Запрос.УстановитьПараметр("ВидРеагента",   Параметры.ВидРеагента);
	Запрос.УстановитьПараметр("Партия",        Параметры.Партия);
	Запрос.УстановитьПараметр("Реагент",       Параметры.Реагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Выборка.КоличествоОстаток < 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Операция не выполнена! Ндостаточно %1%2 реагента", -Выборка.КоличествоОстаток, Параметры.Партия.ЕдиницаИзмеренияКоличества);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры
